In [16]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [22]:
username = 'root' # default username for MySQL db is root
password = 'Hcruise20@' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{urlquote(password)}@localhost/books'
engine = create_engine(connection)

In [9]:
users_url = "Data/users  - users.csv"
users = pd.read_csv(users_url)
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
books_url = "Data/books - books.csv"
books = pd.read_csv(books_url)

In [11]:
authors_url = "Data/authors - authors.csv"
authors = pd.read_csv(authors_url)
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
favorites_url = "Data/favorites - favorites.csv"
favorites = pd.read_csv(favorites_url)
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [23]:
# Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [24]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [25]:
q = '''DESCRIBE users;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [26]:
q = '''DESCRIBE books;'''
pd.read_sql(q, engine)

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int  YES         None

In [27]:
q = '''DESCRIBE authors;'''
pd.read_sql(q, engine)

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [28]:
q = """DESCRIBE favorites;"""
pd.read_sql(q, engine)

     Field Type Null Key Default Extra
0  book_id  int  YES        None
1  user_id  int  YES        None

In [29]:
books.to_sql('books', engine, index=False, if_exists = 'append')

6

In [30]:
users.to_sql('users', engine, index=False, if_exists = 'append')

3

In [31]:
authors.to_sql('authors', engine, index=False, if_exists = 'append')

5

In [32]:
favorites.to_sql('favorites', engine, index=False, if_exists = 'append')

7

In [33]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [34]:
## Test Query
q="""SELECT 
    books.title, favorites.user_id
FROM
    books
        JOIN
    favorites ON books.id = favorites.book_id
WHERE
    favorites.user_id = (SELECT 
            users.id
        FROM
            users
        WHERE
            (users.last_name = 'Doe'
                AND users.first_name = 'John'));
"""
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1